# ParametersDisplayOption Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BendingDetailCustomFieldProperties..::..ParametersDisplayOption Property
BendingDetailCustomFieldProperties Class See Also
---
Identifies how the parameters will be represented.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public BendingDetailDisplayParametersOptions ParametersDisplayOption { get; set; }
```

Visual Basic
---
```text
Public Property ParametersDisplayOption As BendingDetailDisplayParametersOptions
	Get
	Set
```

Visual C++
---
```text
public:
property BendingDetailDisplayParametersOptions ParametersDisplayOption {
	BendingDetailDisplayParametersOptions get ();
	void set (BendingDetailDisplayParametersOptions value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
BendingDetailCustomFieldProperties Class
Autodesk.Revit.DB.Structure Namespace